src/Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПоставщиков</xr:Item>
				<xr:Item>AccumulationRegister.ОбъемыЗакупок</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоступления</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстантыРассчитыватьСтоимость()
	Возврат Константы.РассчитыватьСтоимостьАвтоматически.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция ЦеныНаСервере(ОбновляемыеТовары, Дата)
	Цены           = Новый Массив();
	ДанныеОтбора   = Новый Структура();
	ДанныеРегистра = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(Дата, ДанныеОтбора);
	
	Для Каждого Товар Из ОбновляемыеТовары Цикл
		Строка = ДанныеРегистра.Найти(Товар, "Номенклатура");
		Если Строка = Неопределено Тогда
			Цены.Добавить(0);
		Иначе
			Цены.Добавить(Строка.Цена);
		КонецЕсли;
	КонецЦикла;
	Возврат Цены;
КонецФункции

&НаКлиенте
Процедура ОбновитьСтоимость(Товар)
	Если ПолучитьЗначениеКонстантыРассчитыватьСтоимость() Тогда
		Товар.Стоимость = Товар.ЦенаПоступления * Товар.Количество;
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьВсеСтоимость()
	Если ПолучитьЗначениеКонстантыРассчитыватьСтоимость() Тогда
		Для Каждого Товар Из Объект.Товары Цикл
			ОбновитьСтоимость(Товар);
		КонецЦикла;
	Иначе 		
        Сообщить("Стоимость не рассчитывается!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦенаНаСервере(Номенклатура, Дата)
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
                   |ИЗ
                   |    РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
                   |ГДЕ
                   |    ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
                   |    И ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = &ВидЦены";
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    Запрос.УстановитьПараметр("ВидЦены", "Закупочная");
    РезультатЗапроса = Запрос.Выполнить();
    
    Если Не РезультатЗапроса.Пустой() Тогда
    	Выборка = РезультатЗапроса.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.Цена;
    КонецЕсли; 
    Возврат 0;
    //ДанныеОтбора = Новый Структура("Номенклатура", Номенклатура);
    //
    //ДанныеРегистра = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(Дата,ДанныеОтбора);
    //НужныйВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Закупочная");
    //Для Каждого Строка Из ДанныеРегистра Цикл
    //	Если Строка.ВидЦены = НужныйВидЦены Тогда
    //		Возврат Строка.Цена;	
    //	КонецЕсли;		
    //КонецЦикла;
    //Возврат Неопределено;        
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	Товар.ЦенаПоступления = ЦенаНаСервере(Товар.Номенклатура, Объект.Дата);
	ОбновитьСтоимость(Товар);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Если ПолучитьЗначениеКонстантыРассчитыватьСтоимость() Тогда
		Товар = Элементы.Товары.ТекущиеДанные;
		ОбновитьСтоимость(Товар);
	Иначе
		Сообщить("Стоимость не рассчитывается!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаказПриИзмененииНаСервере(Дата)
	Заказ = Объект.Заказ;
	
	Объект.Поставщик = Заказ.Поставщик;	
	Объект.Склад	 = Заказ.Склад;
	
	Объект.Товары.Очистить();	
	
	Цены   = ЦеныНаСервере(Заказ.Товары.ВыгрузитьКолонку("Номенклатура"), Дата);
	Индекс = 0;
	Для Каждого Товар Из Заказ.Товары Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Товар);
		НоваяСтрока.ЦенаПоступления = Цены[Индекс];
		Индекс = Индекс + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ЗаказПриИзмененииНаСервере(Объект.Дата);
	ОбновитьВсеСтоимость();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	Товары = Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	Цены   = ЦеныНаСервере(Товары, Объект.Дата);
	Индекс = 0;
	Для Каждого Товар Из Объект.Товары Цикл
		Товар.ЦенаПоступления = Цены[Индекс];
		Индекс = Индекс + 1;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
	ОбновитьВсеСтоимость();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПоступленияПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	ОбновитьСтоимость(Товар)
КонецПроцедуры
